pyocd/pyOCD/pyocd/debug/svd/data/HC32M441.svd
                <register>
                    <name>F0NWPRT</name>
                    <description>desc F0NWPRT</description>
                    <addressOffset>0x190</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>F0NWPRT0</name>
                            <description>desc F0NWPRT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT1</name>
                            <description>desc F0NWPRT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT2</name>
                            <description>desc F0NWPRT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT3</name>
                            <description>desc F0NWPRT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT4</name>
                            <description>desc F0NWPRT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT5</name>
                            <description>desc F0NWPRT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT6</name>
                            <description>desc F0NWPRT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT7</name>
                            <description>desc F0NWPRT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT8</name>
                            <description>desc F0NWPRT8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT9</name>
                            <description>desc F0NWPRT9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT10</name>
                            <description>desc F0NWPRT10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT11</name>
                            <description>desc F0NWPRT11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT12</name>
                            <description>desc F0NWPRT12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT13</name>
                            <description>desc F0NWPRT13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT14</name>
                            <description>desc F0NWPRT14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT15</name>
                            <description>desc F0NWPRT15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT16</name>
                            <description>desc F0NWPRT16</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT17</name>
                            <description>desc F0NWPRT17</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT18</name>
                            <description>desc F0NWPRT18</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT19</name>
                            <description>desc F0NWPRT19</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT20</name>
                            <description>desc F0NWPRT20</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT21</name>
                            <description>desc F0NWPRT21</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT22</name>
                            <description>desc F0NWPRT22</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT23</name>
                            <description>desc F0NWPRT23</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT24</name>
                            <description>desc F0NWPRT24</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT25</name>
                            <description>desc F0NWPRT25</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT26</name>
                            <description>desc F0NWPRT26</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT27</name>
                            <description>desc F0NWPRT27</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT28</name>
                            <description>desc F0NWPRT28</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT29</name>
                            <description>desc F0NWPRT29</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT30</name>
                            <description>desc F0NWPRT30</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT31</name>
                            <description>desc F0NWPRT31</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTNMFG</name>
                    <description>desc PTNMFG</description>
                    <addressOffset>0x2EC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF0000</resetMask>
                    <fields>
                        <field>
                            <name>PTNMFG</name>
                            <description>desc PTNMFG</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
