pyocd/pyOCD/pyocd/debug/svd/data/HC32M441.svd
                <register>
                    <name>PVDICR</name>
                    <description>desc PVDICR</description>
                    <addressOffset>0x4CC0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x66</resetMask>
                    <fields>
                        <field>
                            <name>PVD1EDGS</name>
                            <description>desc PVD1EDGS</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2EDGS</name>
                            <description>desc PVD2EDGS</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PVDDSR</name>
                    <description>desc PVDDSR</description>
                    <addressOffset>0x4CC4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x11</resetValue>
                    <resetMask>0x33</resetMask>
                    <fields>
                        <field>
                            <name>PVD1MON</name>
                            <description>desc PVD1MON</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1DETFLG</name>
                            <description>desc PVD1DETFLG</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2MON</name>
                            <description>desc PVD2MON</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2DETFLG</name>
                            <description>desc PVD2DETFLG</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAMPC0</name>
                    <description>desc RAMPC0</description>
                    <addressOffset>0x4CC8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x401</resetMask>
                    <fields>
                        <field>
                            <name>RAMPDC0</name>
                            <description>desc RAMPDC0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMPDC10</name>
                            <description>desc RAMPDC10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAMOPM</name>
                    <description>desc RAMOPM</description>
                    <addressOffset>0x4CCC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x8043</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RAMOPM</name>
                            <description>desc RAMOPM</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PRAMLPC</name>
                    <description>desc PRAMLPC</description>
                    <addressOffset>0x4CD0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x4</resetMask>
                    <fields>
                        <field>
                            <name>PRAMPDC2</name>
                            <description>desc PRAMPDC2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STPMCR</name>
                    <description>desc STPMCR</description>
                    <addressOffset>0xC00C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8003</resetMask>
                    <fields>
                        <field>
                            <name>FLNWT</name>
                            <description>desc FLNWT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKSMRC</name>
                            <description>desc CKSMRC</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>desc STOP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPRC</name>
                    <description>desc FPRC</description>
                    <addressOffset>0xC3FE</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF0B</resetMask>
                    <fields>
                        <field>
                            <name>FPRCB0</name>
                            <description>desc FPRCB0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FPRCB1</name>
                            <description>desc FPRCB1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FPRCB3</name>
                            <description>desc FPRCB3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FPRCWE</name>
                            <description>desc FPRCWE</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
